test/loadTest-Login.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 60
      arrivalRate: 100
      name: "constant 100 req/s"
    - duration: 60
      arrivalRate: 200
      name: "constant 200 req/s"
    - duration: 60
      arrivalRate: 300
      name: "constant 300 req/s"
    - duration: 60
      arrivalRate: 400
      name: "constant 400 req/s"
    - duration: 60
      arrivalRate: 500
      name: "constant 500 req/s"
  payload:
    - path: "./data/payload.csv"
      fields:
        - "driverId"
        - "zip"
        - "lat"
        - "lng"
      order: "sequence"
scenarios:
  - name: "Login"
    weight: 2
    flow:
    - post:
        url: "/drivers/login"
        json:
          driverId: "{{ driverId }}"